Merge pull request #52 from nilenso/feature-issue-50
docs: capture canonical scope
